import { ref, computed } from 'vue'
import { defineStore } from 'pinia'
import authHandler from '@/service/authService.js'


export const useAuthStore = defineStore('auth', () =>
{
  //--------------------------------------------------------------------------------------------------------------------
  // 서버와 데이터 동기화 여부
  //--------------------------------------------------------------------------------------------------------------------
  const   isSynced         = ref(false);
  //--------------------------------------------------------------------------------------------------------------------
  // 로그인 여부 및 사용자 정보
  //--------------------------------------------------------------------------------------------------------------------
  const   isLogin          = ref(false);
  const   loginUser     = ref({})
  const   recentErrorMessage= ref('');
  //--------------------------------------------------------------------------------------------------------------------
  // 관리자 권한 및 이름 관련
  //--------------------------------------------------------------------------------------------------------------------
  const userName = ref('');
  const userId = ref('');
  const isAdmin = ref(false);

  //--------------------------------------------------------------------------------------------------------------------
  // 접속 사용자 권한 체크
  //--------------------------------------------------------------------------------------------------------------------
  const getMyPrivilege = async () => {
    const {result, data} = await authHandler.fetchPlatformCodeList();
    if (data)
    {
      loginUser.value = data;
      isLogin.value   = true;
    }
    else
    {
      recentErrorMessage.value = result;
    }
  };

  const refreshCommonData = async () => {

    if(isSynced.value === false) {
      //------------------------------------------------------------------------------------------------------------------
      // 회사 목록 조회
      //------------------------------------------------------------------------------------------------------------------
      await getMyPrivilege();                           // 회사 목록 조회 (O)

    }
    isSynced.value = true;
  }


  return {isSynced,
          isLogin,
          loginUser,
          recentErrorMessage, userName, userId, isAdmin, refreshCommonData }
})
