package com.nos.home.entity.account;

import com.nos.home.user.account.dto.SignUpFormDto;
import jakarta.persistence.*;
import lombok.Getter;
import lombok.Setter;
import org.springframework.data.annotation.CreatedDate;

import java.time.LocalDateTime;
import java.util.Date;
import java.util.UUID;

@Entity
@Getter
@Setter
@Table(name = "tb_user")
public class AccountEntity {
    public enum Provider {
        LOCAL, FACEBOOK, GOOGLE, APPLE
    }

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 Sequence 번호
    //------------------------------------------------------------------------------------------------------------------
    @Id
    @GeneratedValue(strategy = GenerationType.IDENTITY)
    private Long            userSeq;

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 ID
    //------------------------------------------------------------------------------------------------------------------
    private String          userId;

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 이름
    //------------------------------------------------------------------------------------------------------------------
    private String          name;
    
    //------------------------------------------------------------------------------------------------------------------
    // 사용자 이메일
    //------------------------------------------------------------------------------------------------------------------
    private String          email;              // 사용자 이메일
    private boolean         emailVerified;      // 이메일 인증 여부
    private String          emailToken;         // 이메일 토큰 (회원 가입 시 이메일 인증 토큰)

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 패스워드
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 250)
    private String          password;           // 사용자 패스워드
    private LocalDateTime   passwordChangeDate; // 패스워드 변경 날짜

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 전화번호
    //------------------------------------------------------------------------------------------------------------------
    private String          phone;

    //------------------------------------------------------------------------------------------------------------------
    // 사용자 설명
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 500)
    private String          description;

    //------------------------------------------------------------------------------------------------------------------
    // MFA 사용 여부
    //------------------------------------------------------------------------------------------------------------------
    private boolean         useMfa;

    //------------------------------------------------------------------------------------------------------------------
    // 계정 활성화 여부
    //------------------------------------------------------------------------------------------------------------------
    private boolean         enabled;

    //------------------------------------------------------------------------------------------------------------------
    // [로그인 실패 및 그에 따른 잠금 처리 여부]
    //------------------------------------------------------------------------------------------------------------------
    private int             failedLoginAttempts;

    //------------------------------------------------------------------------------------------------------------------
    // 계정 잠금 여부
    //------------------------------------------------------------------------------------------------------------------
    private boolean         locked;

    //------------------------------------------------------------------------------------------------------------------
    // 계정 잠금 날짜
    //------------------------------------------------------------------------------------------------------------------
    private LocalDateTime   lockedDate;

    //------------------------------------------------------------------------------------------------------------------
    // 가입 방법
    //------------------------------------------------------------------------------------------------------------------
    @Enumerated(EnumType.STRING)
    private Provider        provider = Provider.LOCAL;

    //------------------------------------------------------------------------------------------------------------------
    // 가입 날짜
    //------------------------------------------------------------------------------------------------------------------
    @CreatedDate
    private LocalDateTime   registrationDate;


    //------------------------------------------------------------------------------------------------------------------
    // 사용자 정보를 업데이트 한다.
    //------------------------------------------------------------------------------------------------------------------
    public static AccountEntity of(SignUpFormDto creatDto)
    {
        AccountEntity account = new AccountEntity();
        account.setUserId(creatDto.getUserId());                // 사용자 ID
        account.setPassword(creatDto.getPassword());            // 사용자 패스워드
        account.setName(creatDto.getName());                    // 사용자 이름
        account.setPhone(creatDto.getPhone());                  // 사용자 휴대폰번호
        account.setDescription("");                             // 사용자 설명
        account.setEmail(creatDto.getEmail());                  // 사용자 이메일
        account.setEmailVerified(false);                        // 이메일 인증 여부
        account.setEmailToken(UUID.randomUUID().toString());    // 이메일 토큰 (회원 가입 시 이메일 인증 토큰)
        account.setUseMfa(false);                               // MFA 사용 여부
        account.setEnabled(true);                               // 계정 활성화 여부
        account.setFailedLoginAttempts(0);                      // [로그인 실패 및 그에 따른 잠금 처리 여부]
        account.setLocked(false);                               // 계정 잠금 여부
        account.setLockedDate(null);                            // 계정 잠금 날짜
        account.setProvider(Provider.LOCAL);                    // 가입 방법

        return account;
    }
}
