package com.nos.home.entity.menu;

import com.nos.home.admin.dto.sitemap.AdMenuRegisterDto;
import com.nos.home.entity.common.BaseTimeEntity;
import jakarta.persistence.*;
import lombok.*;

import java.util.HashSet;
import java.util.Set;
import java.util.UUID;

@Getter
@Setter
@Entity
@Table(name = "tb_menu")
@NoArgsConstructor
@AllArgsConstructor
@Builder
public class MenuEntity extends BaseTimeEntity {
    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 아이템 Sequence 번호
    //------------------------------------------------------------------------------------------------------------------
    @Id
    @GeneratedValue(strategy = GenerationType.IDENTITY)
    private Long                        menuSeq;

    //------------------------------------------------------------------------------------------------------------------
    // 사이트맵 정보
    //------------------------------------------------------------------------------------------------------------------
    @Column(name = "sitemap_seq", nullable = false)   // 사이트맵 정보
    private Long                        sitemapSeq;

    @ManyToOne(fetch = FetchType.LAZY)
    @JoinColumn(name = "sitemap_seq", insertable=false, updatable=false)
    private SiteMapEntity               sitemap;

    //------------------------------------------------------------------------------------------------------------------
    // 상위 메뉴 정보
    //------------------------------------------------------------------------------------------------------------------
    @Column(name = "parent_menu_seq")
    private Long                        parentMenuSeq;

    @ManyToOne(fetch = FetchType.LAZY)
    @JoinColumn(name = "parent_menu_seq", insertable=false, updatable=false)
    private MenuEntity                  parentMenu;

    //------------------------------------------------------------------------------------------------------------------
    // 하위 메뉴 정보
    //------------------------------------------------------------------------------------------------------------------
    @OneToMany(mappedBy = "parentMenu")
    private Set<MenuEntity>             childMenus = new HashSet<>();

    //------------------------------------------------------------------------------------------------------------------
    // 모듈 유형
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 50)
    private String                      moduleId;

    //------------------------------------------------------------------------------------------------------------------
    // 모듈 인스턴스 ID
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 50)
    private String                      instanceId;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴명
    //------------------------------------------------------------------------------------------------------------------
    @Column(nullable = false, length = 100)
    private String                      title;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 URL
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 500)
    private String                      url;

    //------------------------------------------------------------------------------------------------------------------
    // Target
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 30)
    private String                      target;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 설명
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 500)
    private String                      description;


    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 아이콘
    //------------------------------------------------------------------------------------------------------------------
    @Column(length = 100)
    private String                      icon;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 수준
    //------------------------------------------------------------------------------------------------------------------
    @Column(nullable = false)
    private Integer                     depth = 1;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 순서
    //------------------------------------------------------------------------------------------------------------------
    @Column(nullable = false)
    private Integer                     position = 0;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 활성화 여부
    //------------------------------------------------------------------------------------------------------------------
    private Boolean                     enabled = true;

    //------------------------------------------------------------------------------------------------------------------
    // 메뉴 등록
    //------------------------------------------------------------------------------------------------------------------
    public static MenuEntity of(AdMenuRegisterDto adMenuRegisterDto)
    {
        MenuEntity menu = MenuEntity.builder()
                .sitemapSeq(adMenuRegisterDto.getSitemapSeq())          // sitemap_seq;
                .parentMenuSeq(null)                                    // 상위 메뉴 ID
                .moduleId(adMenuRegisterDto.getModuleId())              // 모듈 ID
                .instanceId(UUID.randomUUID().toString())               // 인스턴스 ID
                .title(adMenuRegisterDto.getTitle())                    // 메뉴명
                .url(adMenuRegisterDto.getUrl())                        // URL
                .target(adMenuRegisterDto.getTarget())                  // 타겟
                .description(adMenuRegisterDto.getDescription())        // 설명
                .icon(null)                                             // 아이콘
                .depth(1)                                               // 깊이
                .position(0)                                            // 메뉴 순서
                .enabled(true)                                          // 활성화 여부
                .build();
        return menu;
    }
}